<?php
    error_reporting(0);
    $content = 'نماینده مجلس دهم با اشاره به مطالعاتی که انجام داده گفت: کرونا ویروسی نیست که ناگهان به وجود آید، به نظر من منشأ این ویروس ابرقدرت‌ها هستند که چنین جنگی را در برهه‌ای از زمان به راه انداختند و از کنترل خودشان هم خارج شده است. دقیقا نامش را بیوتروریسم می‌گذاریم که در برنامه های خود مطرح می‌کردند و کمترین هزینه‌ای برایشان ندارد. وی ادامه داد: در گذشته‌های دور وقتی انسان‌ها جنگ تن به تن می‌کردند با شمشیر، نیزه، تیر و تفنگ همدیگر را می‌کشتند و سرزمین آن کشور را تسخیر می‌کردند و منابعشان را به تاراج می‌بردند، اما الان این کمترین هزینه است که یک ویروس را پخش می‌کنند و خود مردم عامل پخش این ویروس می‌شوند و جنگ و تفنگی در کار نیست و نمی‌توان انگشت اتهام را به سمت کسی که حمله کرده گرفت؛ چون جنگ مخفی است و معلوم نیست. ویروس هم به چشم دیده نمی‌شود و زبان ندارد که از او پرسیده شود که از کجا آمده و چگونه و از کجا کنترل می‌شود. برزگر گفت: تنها، کشوری در این دوره زمانی موفق است که بتواند در برابر این تهاجمات قدرتمند باشد و با تیم پزشکی قوی، اقتصاد قوی و با شرایط سیاسی قوی؛ در برابر ویروسی که بی زبان است و نمی‌توان با چشم غیر مسلح دیده شود در این دنیای مدرن با آن مقابله کند. یکی از ویژگی‌های «های تکنولوژی» همین موضوع است که ابرقدرت‌ها و نظام سرمایه‌داری به دنبال آن هستند. عضو کمیسیون امنیت ملی و سیاست خارجی مجلس اظهار داشت: به نظرم با پهنایی که این ویروس در جهان در حال انتشار است و باتوجه به مطالعاتی که درباره کشورهای مورد هدف قرار گرفته شده داشتم، ردپایی از آمریکا شیطان بزرگ می‌بینم که زمان این را ثابت خواهد کرد که به دنبال چه هستند و در آینده به جهانیان ثابت خواهد شد. در حال حاضر از کنترل خودشان خارج شده و به کشورشان رفته است؛ بماند که کدام کشور در این ماراتن مبارزه با ویروس بی‌زبان و بی‌هویت می‌تواند واکسنش را تولید کند و جان هزاران هزار انسان بی‌گناه را نجات دهد. نماینده مردم سلماس با اشاره به اقدامات آمریکا تصریح کرد: این ویروس شبیه ترور است. ترور یعنی ایجاد رعب و وحشت. می‌بینید چگونه در دنیا رعب و وحشت ایجاد کرده و چه کسانی از ترور و تروریسم حمایت می‌کنند. اگر به تاریخ هم نگاه کنید باز به همین کشورهای قدرتمند برمی‌گردید که کار آنهاست و کارشان شیطانی است و به دنبال ساخت بمب هسته‌ای و تجهیزات کشتار جمعی هستند.';
    require_once 'env.php';
    $exploded = explode(' ', $content); //تبدیل محتوا به ارایه
    $founds = []; // بدون استفاده
    foreach ($exploded as $key => $word) { // طی کردن طول آرایه محتوا
        foreach ($hrefs as $anchor => $href) { //طی کردن طول ارایه کلمات کلیدی
            $state = 1;
            if (strpos($word, $anchor) !== false) {
                $exact = substr($word, 0, strlen($anchor)); // ساخت زیر رشته از کلمه بصورت دقیق برای جایگیزینی
                foreach($fa_char as $unallowed) { // چک کردن کاراکتر فارسی قبل یا بعد برای عدم لینک بین کلمه ای
                    if($word[strlen($anchor)+1] == $unallowed || $word[$pos-1] == $unallowed) {
                        $state = 0;
                    }
                }
                foreach($en_char as $unallowed) { // چک کردن کاراکتر انگلیسی قبل یا بعد برای عدم لینک بین کلمه ای
                    if($word[strlen($anchor)+1] == $unallowed || $word[$pos-1] == $unallowed) {
                        $state = 0;
                    }
                }
                if ($state) {
                    if (!array_key_exists($exact, $founds)) {
                        // $founds[] = str_replace($exact, "<a href='$href'>$exact</a>", $word);
                        $exploded[$key] = str_replace($exact, "<a href='$href'>$exact</a>", $word);
                        $founds["$exact"] = 1;
                    }
                } else {
                    // $founds[] = $word;
                    $exploded[$key] = $word;
                }
            }
        }
    }
    $final = implode(' ',$exploded);
?>

<!DOCTYPE html>
<html lang="fa" dir="rtl">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Content</title>
</head>
<body>
<h1>متن اصلی</h1>
<p style="background: lightgray; padding: 5px;">
<?php echo $content; ?>
</p>
<h1>متن نهایی</h1>
<p style="background: lightblue; padding: 5px;">
<?php echo $final; ?>
</p>

</body>
</html>