<?php
    if (!function_exists('mb_str_word_count'))
    {
        function mb_str_word_count($string, $format = 0, $charlist = '[]') {
            $string=trim($string);
            $string=str_replace(['.', '/', '-', ')', '(', '،', 'و'], '', $string);
            if(empty($string))
                $words = array();
            else
                $words = preg_split('~[^\p{L}\p{N}\']+~u',$string);
            switch ($format) {
                case 0:
                    return count($words);
                    break;
                case 1:
                case 2:
                    return $words;
                    break;
                default:
                    return $words;
                    break;
            }
        }
    }

    function word_count($content) {
        $content = trim($content);
        $content = str_replace(['.', '/', '-', ')', '(', '،', 'و', ':'], '', $content);
        return count(explode(' ', $content));
    }

    function CheckKeywordDensity($content, $keyword) {
        $info = [
            'word_count' => word_count($content),
            'keyword_count' => 0,
            'density' => null,
        ];
        $counter = 0;
        $exploded = explode(' ', $content);
        foreach ($exploded as $word) {
            if ($word == $keyword) {
                $info['keyword_count'] += 1;
            }
        }
        $info['density'] = ( $info['keyword_count']/$info['word_count'] ) * 100;
        
        return $info;
    }

    // if (function_exists('CheckKeywordDensity')) {
    //     $content = 'حادثه نیوز: قاتل فراری در تهران پس از سه سال دستگیر شد.
    //     به گزارش حادثه نیوز، ساعت یک بامداد نخستین روز فروردین سال 99 خانواده ای با ماموران پلیس تماس گرفتند و از درگیری و دستگیری قاتل فراری پس از 3 سال در میدان فاطمی خبر دادند و خیلی زود تیمی از ماموران برای تحقیقات به محل اعزام شدند.
    //     ماموران با حضور در محل ابتدا به سراغ خانواده ای رفتند که ادعا می کردند این مرد سال 95 در یک آتش سوزی عمدی دست به قتل 3 زن در ماهشهر کرده قتل قتل قتل است و پس از 3 سال او را شناسایی کردیم.
    //     بدین ترتیب ماموران اقدام به دستگیری متهم کردند و در حالیکه این مرد اصرار داشت بیگناه است ماموران با استعلام گرفتن از پلیس ماهشهر با اطلاع شدند که در سال 95 در یک آتش سوزی عمدی 3 زن جوان به کام مرگ فرو رفتند .
    //     در تحقیقات مشخص شد که از زمان قتل آتشین این مرد که به عنوان مظنون اصلی پرونده بوده فراری شده تا اینکه خانواده قربانیان موفق به شناسایی وی در میدان فاطمی تهران می شوند.
    //     بنا به این گزارش، در حالیکه متهم اصرار به بیگناهی دارد برای تحقیقات بیشتر به دستور بازپرس ویژه به دادگاه عمومی و انقلاب شهرستان ماهشهر معرفی شد تا تحقیقات تکمیلی در موقعیت جغرافیایی جرم صورت گیرد.
        
    //     منبع: رکنا:
        
    //     انتهای پیام/';
    //     $optimizeInfo = CheckKeywordDensity($content, 'قتل');
    // }

    // echo word_count('لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.  

    // لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.  
    
    // لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و');